; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l29_p29_c29_g29_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 food)
	(crate-content crate22 food)
	(crate-content crate23 food)
	(crate-content crate24 food)
	(crate-content crate25 food)
	(crate-content crate26 medicine)
	(crate-content crate27 medicine)
	(crate-content crate28 medicine)
	(crate-content crate29 medicine)
	(at person1 loc16)
	(at person2 loc5)
	(at person3 loc8)
	(at person4 loc6)
	(at person5 loc21)
	(at person6 loc10)
	(at person7 loc7)
	(at person8 loc28)
	(at person9 loc8)
	(at person10 loc14)
	(at person11 loc16)
	(at person12 loc12)
	(at person13 loc28)
	(at person14 loc17)
	(at person15 loc24)
	(at person16 loc13)
	(at person17 loc13)
	(at person18 loc10)
	(at person19 loc27)
	(at person20 loc8)
	(at person21 loc5)
	(at person22 loc11)
	(at person23 loc11)
	(at person24 loc9)
	(at person25 loc29)
	(at person26 loc11)
	(at person27 loc23)
	(at person28 loc5)
	(at person29 loc20)
	(person-needs person1 food)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person4 medicine)
	(person-needs person5 food)
	(person-needs person6 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person11 medicine)
	(person-needs person12 food)
	(person-needs person13 food)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person17 medicine)
	(person-needs person18 food)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person21 food)
	(person-needs person22 food)
	(person-needs person23 food)
	(person-needs person24 food)
	(person-needs person26 food)
	(person-needs person27 food)
	(person-needs person28 food)
	(person-needs person29 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person5 food)
	(person-has person6 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person11 medicine)
	(person-has person12 food)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person17 medicine)
	(person-has person18 food)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person21 food)
	(person-has person22 food)
	(person-has person23 food)
	(person-has person24 food)
	(person-has person26 food)
	(person-has person27 food)
	(person-has person28 food)
	(person-has person29 medicine)
	))
)

; plan
1. (grab-arm1 drone1 crate27 depot)
   deleted: (arm1-free drone1) (at crate27 depot)
   added: (arm1-load drone1 crate27)
   goals met: 1 of 30
2. (grab-arm2 drone1 crate28 depot)
   deleted: (arm2-free drone1) (at crate28 depot)
   added: (arm2-load drone1 crate28)
   goals met: 1 of 30
3. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 0 of 30
4. (deliver-arm2 drone1 person11 crate28 medicine loc16)
   deleted: (arm2-load drone1 crate28) (person-needs person11 medicine)
   added: (arm2-free drone1) (person-has person11 medicine)
   goals met: 1 of 30
5. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 2 of 30
6. (grab-arm2 drone1 crate29 depot)
   deleted: (arm2-free drone1) (at crate29 depot)
   added: (arm2-load drone1 crate29)
   goals met: 2 of 30
7. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 1 of 30
8. (deliver-arm2 drone1 person17 crate29 medicine loc13)
   deleted: (arm2-load drone1 crate29) (person-needs person17 medicine)
   added: (arm2-free drone1) (person-has person17 medicine)
   goals met: 2 of 30
9. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 3 of 30
10. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 3 of 30
11. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 2 of 30
12. (move-drone drone1 loc13 loc20)
   deleted: (at drone1 loc13)
   added: (at drone1 loc20)
   goals met: 2 of 30
13. (deliver-arm2 drone1 person29 crate26 medicine loc20)
   deleted: (arm2-load drone1 crate26) (person-needs person29 medicine)
   added: (arm2-free drone1) (person-has person29 medicine)
   goals met: 3 of 30
14. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 4 of 30
15. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 3 of 30
16. (move-drone drone1 loc22 loc6)
   deleted: (at drone1 loc22)
   added: (at drone1 loc6)
   goals met: 3 of 30
17. (deliver-arm1 drone1 person4 crate27 medicine loc6)
   deleted: (arm1-load drone1 crate27) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 4 of 30
18. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 5 of 30
19. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 5 of 30
20. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 4 of 30
21. (deliver-arm1 drone1 person1 crate2 food loc16)
   deleted: (arm1-load drone1 crate2) (person-needs person1 food)
   added: (arm1-free drone1) (person-has person1 food)
   goals met: 5 of 30
22. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 6 of 30
23. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 6 of 30
24. (grab-arm2 drone1 crate20 depot)
   deleted: (arm2-free drone1) (at crate20 depot)
   added: (arm2-load drone1 crate20)
   goals met: 6 of 30
25. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 5 of 30
26. (deliver-arm1 drone1 person5 crate3 food loc21)
   deleted: (arm1-load drone1 crate3) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 6 of 30
27. (move-drone drone1 loc21 loc10)
   deleted: (at drone1 loc21)
   added: (at drone1 loc10)
   goals met: 6 of 30
28. (deliver-arm2 drone1 person6 crate20 food loc10)
   deleted: (arm2-load drone1 crate20) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 7 of 30
29. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 8 of 30
30. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 8 of 30
31. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 8 of 30
32. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 7 of 30
33. (deliver-arm1 drone1 person8 crate24 food loc28)
   deleted: (arm1-load drone1 crate24) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 8 of 30
34. (move-drone drone1 loc28 loc8)
   deleted: (at drone1 loc28)
   added: (at drone1 loc8)
   goals met: 8 of 30
35. (deliver-arm2 drone1 person9 crate23 food loc8)
   deleted: (arm2-load drone1 crate23) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 9 of 30
36. (move-drone drone1 loc8 loc9)
   deleted: (at drone1 loc8)
   added: (at drone1 loc9)
   goals met: 9 of 30
37. (move-drone drone1 loc9 loc25)
   deleted: (at drone1 loc9)
   added: (at drone1 loc25)
   goals met: 9 of 30
38. (move-drone drone1 loc25 loc4)
   deleted: (at drone1 loc25)
   added: (at drone1 loc4)
   goals met: 9 of 30
39. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 10 of 30
40. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 10 of 30
41. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 9 of 30
42. (deliver-arm2 drone1 person10 crate13 food loc14)
   deleted: (arm2-load drone1 crate13) (person-needs person10 food)
   added: (arm2-free drone1) (person-has person10 food)
   goals met: 10 of 30
43. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 11 of 30
44. (grab-arm2 drone1 crate15 depot)
   deleted: (arm2-free drone1) (at crate15 depot)
   added: (arm2-load drone1 crate15)
   goals met: 11 of 30
45. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 11 of 30
46. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 10 of 30
47. (deliver-arm2 drone1 person4 crate15 food loc6)
   deleted: (arm2-load drone1 crate15) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 11 of 30
48. (move-drone drone1 loc6 loc12)
   deleted: (at drone1 loc6)
   added: (at drone1 loc12)
   goals met: 11 of 30
49. (deliver-arm1 drone1 person12 crate12 food loc12)
   deleted: (arm1-load drone1 crate12) (person-needs person12 food)
   added: (arm1-free drone1) (person-has person12 food)
   goals met: 12 of 30
50. (move-drone drone1 loc12 loc1)
   deleted: (at drone1 loc12)
   added: (at drone1 loc1)
   goals met: 12 of 30
51. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 13 of 30
52. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 13 of 30
53. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 13 of 30
54. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 12 of 30
55. (deliver-arm2 drone1 person13 crate18 food loc28)
   deleted: (arm2-load drone1 crate18) (person-needs person13 food)
   added: (arm2-free drone1) (person-has person13 food)
   goals met: 13 of 30
56. (move-drone drone1 loc28 loc17)
   deleted: (at drone1 loc28)
   added: (at drone1 loc17)
   goals met: 13 of 30
57. (deliver-arm1 drone1 person14 crate1 food loc17)
   deleted: (arm1-load drone1 crate1) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 14 of 30
58. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 15 of 30
59. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 15 of 30
60. (grab-arm2 drone1 crate19 depot)
   deleted: (arm2-free drone1) (at crate19 depot)
   added: (arm2-load drone1 crate19)
   goals met: 15 of 30
61. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 14 of 30
62. (deliver-arm1 drone1 person15 crate17 food loc24)
   deleted: (arm1-load drone1 crate17) (person-needs person15 food)
   added: (arm1-free drone1) (person-has person15 food)
   goals met: 15 of 30
63. (move-drone drone1 loc24 loc13)
   deleted: (at drone1 loc24)
   added: (at drone1 loc13)
   goals met: 15 of 30
64. (deliver-arm2 drone1 person16 crate19 food loc13)
   deleted: (arm2-load drone1 crate19) (person-needs person16 food)
   added: (arm2-free drone1) (person-has person16 food)
   goals met: 16 of 30
65. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 17 of 30
66. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 17 of 30
67. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 17 of 30
68. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 16 of 30
69. (deliver-arm2 drone1 person17 crate22 food loc13)
   deleted: (arm2-load drone1 crate22) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 17 of 30
70. (move-drone drone1 loc13 loc5)
   deleted: (at drone1 loc13)
   added: (at drone1 loc5)
   goals met: 17 of 30
71. (deliver-arm1 drone1 person2 crate10 food loc5)
   deleted: (arm1-load drone1 crate10) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 18 of 30
72. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 19 of 30
73. (grab-arm2 drone1 crate25 depot)
   deleted: (arm2-free drone1) (at crate25 depot)
   added: (arm2-load drone1 crate25)
   goals met: 19 of 30
74. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 18 of 30
75. (deliver-arm2 drone1 person18 crate25 food loc10)
   deleted: (arm2-load drone1 crate25) (person-needs person18 food)
   added: (arm2-free drone1) (person-has person18 food)
   goals met: 19 of 30
76. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 20 of 30
77. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 20 of 30
78. (move-drone drone1 depot loc27)
   deleted: (at drone1 depot)
   added: (at drone1 loc27)
   goals met: 19 of 30
79. (deliver-arm2 drone1 person19 crate8 food loc27)
   deleted: (arm2-load drone1 crate8) (person-needs person19 food)
   added: (arm2-free drone1) (person-has person19 food)
   goals met: 20 of 30
80. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 21 of 30
81. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 21 of 30
82. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 20 of 30
83. (deliver-arm2 drone1 person20 crate21 food loc8)
   deleted: (arm2-load drone1 crate21) (person-needs person20 food)
   added: (arm2-free drone1) (person-has person20 food)
   goals met: 21 of 30
84. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 22 of 30
85. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 22 of 30
86. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 21 of 30
87. (deliver-arm2 drone1 person21 crate5 food loc5)
   deleted: (arm2-load drone1 crate5) (person-needs person21 food)
   added: (arm2-free drone1) (person-has person21 food)
   goals met: 22 of 30
88. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 23 of 30
89. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 23 of 30
90. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 22 of 30
91. (deliver-arm2 drone1 person22 crate11 food loc11)
   deleted: (arm2-load drone1 crate11) (person-needs person22 food)
   added: (arm2-free drone1) (person-has person22 food)
   goals met: 23 of 30
92. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 24 of 30
93. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 24 of 30
94. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 23 of 30
95. (deliver-arm2 drone1 person23 crate14 food loc11)
   deleted: (arm2-load drone1 crate14) (person-needs person23 food)
   added: (arm2-free drone1) (person-has person23 food)
   goals met: 24 of 30
96. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 25 of 30
97. (grab-arm2 drone1 crate16 depot)
   deleted: (arm2-free drone1) (at crate16 depot)
   added: (arm2-load drone1 crate16)
   goals met: 25 of 30
98. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 24 of 30
99. (deliver-arm2 drone1 person24 crate16 food loc9)
   deleted: (arm2-load drone1 crate16) (person-needs person24 food)
   added: (arm2-free drone1) (person-has person24 food)
   goals met: 25 of 30
100. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 26 of 30
101. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 26 of 30
102. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 25 of 30
103. (move-drone drone1 loc7 loc11)
   deleted: (at drone1 loc7)
   added: (at drone1 loc11)
   goals met: 25 of 30
104. (deliver-arm2 drone1 person26 crate7 food loc11)
   deleted: (arm2-load drone1 crate7) (person-needs person26 food)
   added: (arm2-free drone1) (person-has person26 food)
   goals met: 26 of 30
105. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 27 of 30
106. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 27 of 30
107. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 26 of 30
108. (deliver-arm2 drone1 person27 crate9 food loc23)
   deleted: (arm2-load drone1 crate9) (person-needs person27 food)
   added: (arm2-free drone1) (person-has person27 food)
   goals met: 27 of 30
109. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 28 of 30
110. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 28 of 30
111. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 27 of 30
112. (deliver-arm2 drone1 person28 crate6 food loc5)
   deleted: (arm2-load drone1 crate6) (person-needs person28 food)
   added: (arm2-free drone1) (person-has person28 food)
   goals met: 28 of 30
113. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 29 of 30
114. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 29 of 30
115. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 28 of 30
116. (deliver-arm2 drone1 person3 crate4 food loc8)
   deleted: (arm2-load drone1 crate4) (person-needs person3 food)
   added: (arm2-free drone1) (person-has person3 food)
   goals met: 29 of 30
117. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 30 of 30
